kaspar030/RIOT/cpu/cc26x0/cc26xx_rfcore/cc26xx_rfcore.c
exit:

    if (!interruptsWereDisabled)
    {
        IntMasterEnable();
    }

    return ret;
}

/**
 * Error interrupt handler.
 */
void isr_rfc_cpe1(void)
{
    /* Clear INTERNAL_ERROR interrupt flag */
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = 0x7FFFFFFF;
}

/**
 * Command done handler.
 */
void isr_rfc_cpe0(void)
{
    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_LAST_COMMAND_DONE)
    {
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_LAST_COMMAND_DONE;

        if (cc26xx_rfcore_state == cc2650_stateReceive && sReceiveCmd.status != ACTIVE && sReceiveCmd.status != IEEE_SUSPENDED)
        {
            /* the rx command was probably aborted to change the channel */
            cc26xx_rfcore_state = cc2650_stateSleep;
        }
        else if (cc26xx_rfcore_state == cc2650_stateEdScan)
        {
            cc26xx_rfcore_state = cc2650_stateSleep;
        }
    }

    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_LAST_FG_COMMAND_DONE)
    {
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_LAST_FG_COMMAND_DONE;

        if (cc26xx_rfcore_state == cc2650_stateTransmit)
        {
            if (sTransmitCmd.pPayload[0] & IEEE802154_ACK_REQUEST)
            {
                /* we are looking for an ack */
                switch (sTransmitRxAckCmd.status)
                {
                case IEEE_DONE_TIMEOUT:
                    if (sTransmitRetryCount < IEEE802154_MAC_MAX_FRAMES_RETRIES)
                    {
                        /* re-submit the tx command chain */
                        sTransmitRetryCount++;
                        RFCDoorbellSendTo((uint32_t)&sCsmacaBackoffCmd);
                    }
                    else
                    {
                        sTransmitError = OT_ERROR_NO_ACK;
                        /* signal polling function we are done transmitting, we failed to send the packet */
                        sTxCmdChainDone = true;
                    }

                    break;

                case IEEE_DONE_ACK:
                    sTransmitError = OT_ERROR_NONE;
                    /* signal polling function we are done transmitting */
                    sTxCmdChainDone = true;
                    break;

                case IEEE_DONE_ACKPEND:
                    sTransmitError = OT_ERROR_NONE;
                    /* signal polling function we are done transmitting */
                    sTxCmdChainDone = true;
                    break;

                default:
                    sTransmitError = OT_ERROR_FAILED;
                    /* signal polling function we are done transmitting */
                    sTxCmdChainDone = true;
                    break;
                }
            }
            else
            {
                /* The TX command was either stopped or we are not looking for
                 * an ack */
                switch (sTransmitCmd.status)
                {
                case IEEE_DONE_OK:
                    sTransmitError = OT_ERROR_NONE;
                    break;

                case IEEE_DONE_TIMEOUT:
                    sTransmitError = OT_ERROR_CHANNEL_ACCESS_FAILURE;
                    break;

                case IEEE_ERROR_NO_SETUP:
                case IEEE_ERROR_NO_FS:
                case IEEE_ERROR_SYNTH_PROG:
                    sTransmitError = OT_ERROR_INVALID_STATE;
                    break;

                case IEEE_ERROR_TXUNF:
                    sTransmitError = OT_ERROR_NO_BUFS;
                    break;

                default:
                    sTransmitError = OT_ERROR_FAILED;
                    break;
                }

                /* signal polling function we are done transmitting */
                sTxCmdChainDone = true;
            }
        }
    }

    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_RX_OK) {
        sFlags |= 1;
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_RX_OK;
    }

    if (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) & IRQ_TX_DONE) {
        HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~IRQ_TX_DONE;
    }

    if (sTxCmdChainDone) {
        sTxCmdChainDone = false;
        sFlags |= 2;
        cc26xx_rfcore_state = cc2650_stateReceive;
        mutex_unlock(&_tx_lock);
    }

    if (sFlags) {
        if (_irq_handler) {
            _irq_handler(_irq_handler_arg);
        }
    }
}

/**
 * Function documented in platform-cc2650.h
 */
void cc2650RadioInit(void)
{
    /* Populate the RX parameters data structure with default values */
    rfCoreInitReceiveParams();

    cc26xx_rfcore_state = cc2650_stateDisabled;
}

/**
 * Function documented in platform/radio.h
 */
unsigned cc26xx_rfcore_enable(void)
{
    unsigned error = OT_ERROR_BUSY;

    if (cc26xx_rfcore_state == cc2650_stateSleep)
    {
        error = OT_ERROR_NONE;
    }
    else if (cc26xx_rfcore_state == cc2650_stateDisabled)
    {
        puts("on");
        if (!(rfCorePowerOn() == CMDSTA_Done)) {
            error = OT_ERROR_FAILED;
            goto exit;
        }
        puts("enable");
        if (!(rfCoreSendEnableCmd() == DONE_OK)) {
            error = OT_ERROR_FAILED;
            goto exit;
        }
        cc26xx_rfcore_state = cc2650_stateSleep;
    }

exit:

    if (error == OT_ERROR_FAILED)
    {
        rfCorePowerOff();
        cc26xx_rfcore_state = cc2650_stateDisabled;
    }

    return error;
}

unsigned cc26xx_rfcore_disable(void)
{
    puts("disable");
    return 0;

    unsigned error = OT_ERROR_BUSY;

    if (cc26xx_rfcore_state == cc2650_stateDisabled)
    {
        error = OT_ERROR_NONE;
    }
    else if (cc26xx_rfcore_state == cc2650_stateSleep)
    {
        rfCoreSendDisableCmd();
        /* we don't want to fail if this command string doesn't work, just turn
         * off the whole core
         */
        rfCorePowerOff();
        cc26xx_rfcore_state = cc2650_stateDisabled;
        error  = OT_ERROR_NONE;
    }

    return error;
}

unsigned cc26xx_rfcore_rx_start(void)
{
    unsigned error = OT_ERROR_BUSY;

