kaspar030/RIOT/cpu/cc26x0/cc26xx_rfcore/cc26xx_rfcore.c
    if (cc26xx_rfcore_state == cc2650_stateSleep)
    {
        cc26xx_rfcore_state = cc2650_stateReceive;

        /* initialize the receive command
         * XXX: no memset here because we assume init has been called and we
         *      may have changed some values in the rx command
         */
        if (!(rfCoreSendReceiveCmd() == CMDSTA_Done)) {
            error = OT_ERROR_FAILED;
            goto exit;
        }
        error = OT_ERROR_NONE;
    }
    else if (cc26xx_rfcore_state == cc2650_stateReceive)
    {
        if (sReceiveCmd.status == ACTIVE)
        {
            /* we are already receiving */
            cc26xx_rfcore_state = cc2650_stateReceive;
            error  = OT_ERROR_NONE;
        }
        else
        {
            /* we have either not fallen back into our receive command or
             * we are running on the wrong channel. Either way assume the
             * caller correctly called us and abort all running commands.
             */
            if (!(rfCoreExecuteAbortCmd() == CMDSTA_Done)) {
                error = OT_ERROR_FAILED;
                goto exit;
            }

            /* any frames in the queue will be for the old channel */
            if (!(rfCoreClearReceiveQueue(&sRxDataQueue) == CMDSTA_Done)) {
                error = OT_ERROR_FAILED;
                goto exit;
            }

            if (!(rfCoreSendReceiveCmd() == CMDSTA_Done)) {
                error = OT_ERROR_FAILED;
                goto exit;
            }

            cc26xx_rfcore_state = cc2650_stateReceive;
            error  = OT_ERROR_NONE;
        }
    }

exit:
    return error;
}

unsigned cc26xx_rfcore_rx_stop(void)
{
    unsigned error = OT_ERROR_BUSY;

    if (cc26xx_rfcore_state == cc2650_stateReceive)
    {
        if (!(rfCoreExecuteAbortCmd() == CMDSTA_Done)) {
            error = OT_ERROR_FAILED;
            goto exit;
        }

        cc26xx_rfcore_state = cc2650_stateSleep;
        error  = OT_ERROR_NONE;
    }

exit:
    return error;
}

void cc26xx_rfcore_set_pan(uint16_t aPanid)
{
    /* XXX: if the pan id is the broadcast pan id (0xFFFF) the auto ack will
     * not work. This is due to the design of the CM0 and follows IEEE 802.15.4
     */
    if (sReceiveCmd.localPanID == aPanid) {
        return;
    }

    int rx_was_active = (cc26xx_rfcore_state == cc2650_stateReceive);

    if (rx_was_active) {
        cc26xx_rfcore_rx_stop();
    }

    sReceiveCmd.localPanID = aPanid;

    if (rx_was_active) {
        cc26xx_rfcore_rx_start();
    }
    // TODO: handle cc26xx_rfcore_state == cc2650_stateTransmit

    return;
}

uint16_t cc26xx_rfcore_get_pan(void)
{
    return sReceiveCmd.localPanID;
}

void cc26xx_rfcore_set_chan(uint16_t channel)
{
    if (sReceiveCmd.channel == channel) {
        return;
    }

    int rx_was_active = (cc26xx_rfcore_state == cc2650_stateReceive);

    if (rx_was_active) {
        cc26xx_rfcore_rx_stop();
    }

    sReceiveCmd.channel = channel;

    if (rx_was_active) {
        cc26xx_rfcore_rx_start();
    }
    // TODO: handle cc26xx_rfcore_state == cc2650_stateTransmit

    return;
}

uint8_t cc26xx_rfcore_get_chan(void)
{
    return sReceiveCmd.channel;
}

void cc26xx_rfcore_get_ieee_eui64(uint8_t *aIeeeEui64)
{
    uint8_t *    eui64;
    unsigned int i;

    /* The IEEE MAC address can be stored two places. We check the Customer
     * Configuration was not set before defaulting to the Factory
     * Configuration.
     */
    eui64 = (uint8_t *)(CCFG_BASE + CCFG_O_IEEE_MAC_0);

    for (i = 0; i < IEEE802154_LONG_ADDRESS_LEN; i++)
    {
        if (eui64[i] != CC2650_UNKNOWN_EUI64)
        {
            break;
        }
    }

    if (i >= IEEE802154_LONG_ADDRESS_LEN)
    {
        /* The ccfg address was all 0xFF, switch to the fcfg */
        eui64 = (uint8_t *)(FCFG1_BASE + FCFG1_O_MAC_15_4_0);
    }

    /* The IEEE MAC address is stored in network byte order (big endian).
     * The caller seems to want the address stored in little endian format,
     * which is backwards of the conventions setup by @ref
     * otPlatRadioSetExtendedAddress. otPlatRadioSetExtendedAddress assumes
     * that the address being passed to it is in network byte order (big
     * endian), so the caller of otPlatRadioSetExtendedAddress must swap the
     * endianness before calling.
     *
     * It may be easier to have the caller of this function store the IEEE
     * address in network byte order (big endian).
     */
    for (i = 0; i < IEEE802154_LONG_ADDRESS_LEN; i++)
    {
        aIeeeEui64[i] = eui64[(IEEE802154_LONG_ADDRESS_LEN - 1) - i];
    }
}

void cc26xx_rfcore_irq_set_handler(void(*handler)(void *), void * arg)
{
    _irq_handler = handler;
    _irq_handler_arg = arg;
}

unsigned cc26xx_get_flags(void)
{
    unsigned flags = sFlags;
    sFlags = 0;
    return flags;
}


int cc26xx_rfcore_recv(void *buf, size_t len, netdev_ieee802154_rx_info_t *rx_info)
{
    rfc_ieeeRxCorrCrc_t *   crcCorr;
    rfc_dataEntryGeneral_t *curEntry, *startEntry;
    uint8_t                 rssi;
    (void)rssi;

    startEntry = (rfc_dataEntryGeneral_t *)sRxDataQueue.pCurrEntry;
    curEntry   = startEntry;

    /* loop through receive queue */
    do {
        uint8_t *payload = &(curEntry->data);

        if (curEntry->status == DATA_ENTRY_FINISHED) {
            uint8_t      payload_len;

            /* get the information appended to the end of the frame.
             * This array access looks like it is a fencepost error, but the
             * first byte is the number of bytes that follow.
             */
            payload_len = payload[0];
            crcCorr     = (rfc_ieeeRxCorrCrc_t *)&payload[len];
            rssi        = payload[payload_len - 1];

            if (crcCorr->status.bCrcErr == 0 && (payload_len - 2) < OT_RADIO_FRAME_MAX_SIZE) {
                if (!buf) {
                    if (!len) {
                        return payload_len;
                    }
                    if (len == payload_len) {
                        /* drop packet */
                        curEntry->status = DATA_ENTRY_PENDING;
                        return 0;
                    }
                }

                if (payload_len > len) {
                    return -ENOSPC;
                }

                /* substract checksum bytes */
                payload_len -= 2;

