kaspar030/RIOT/cpu/cc26x0/cc26xx_rfcore/cc26xx_rfcore.c
                /* copy packet data */
                memcpy(buf, &(payload[1]), payload_len);

                /* save rx info */
                if (rx_info) {
                    rx_info->rssi = rssi;
                    rx_info->lqi = crcCorr->status.corr;
                }

                curEntry->status = DATA_ENTRY_PENDING;

                return payload_len;
            }
            else {
                puts("recv error fcs");
            }

            curEntry->status = DATA_ENTRY_PENDING;
        }

        curEntry = (rfc_dataEntryGeneral_t *)(curEntry->pNextEntry);
    } while (curEntry != startEntry);
    return 0;
}

int cc26xx_rfcore_recv_avail(void)
{
    rfc_dataEntryGeneral_t *curEntry, *startEntry;

    startEntry = (rfc_dataEntryGeneral_t *)sRxDataQueue.pCurrEntry;
    curEntry   = startEntry;

    /* loop through receive queue */
    do {
        if (curEntry->status == DATA_ENTRY_FINISHED) {
            return 1;
        }

        curEntry = (rfc_dataEntryGeneral_t *)(curEntry->pNextEntry);
    } while (curEntry != startEntry);
    return 0;
}

int cc26xx_rfcore_send(const iolist_t *iolist)
{
    mutex_lock(&_tx_lock);
    if (cc26xx_rfcore_state == cc2650_stateReceive) {
        size_t len = 0;
        uint8_t *bufpos = sTxBuf0;

        for (const iolist_t *iol = iolist; iol; iol = iol->iol_next) {
            len += iol->iol_len;
            if (len > TX_BUF_SIZE) {
                DEBUG("cc26xx_rfcore: error: packet too large (%u bytes to be sent)\n",
                      (unsigned)len);
                mutex_unlock(&_tx_lock);
                return -EOVERFLOW;
            }

            memcpy(bufpos, iol->iol_base, iol->iol_len);
            bufpos += iol->iol_len;
        }

        cc26xx_rfcore_state = cc2650_stateTransmit;
        sTxCmdChainDone = false;

        if (!(rfCoreSendTransmitCmd(sTxBuf0, len) == CMDSTA_Done)) {
            puts("s err");
            cc26xx_rfcore_state = cc2650_stateReceive;
            mutex_unlock(&_tx_lock);
            return -1;
        }

        return len;
    }
    else {
        mutex_unlock(&_tx_lock);
        return -EAGAIN;
    }
}

unsigned cc26xx_rfcore_irq_is_enabled(unsigned irq)
{
    return (HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) & irq) != 0;
}

void cc26xx_rfcore_irq_enable(unsigned irq)
{
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = ~irq;
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) |= irq;
}

void cc26xx_rfcore_irq_disable(unsigned irq)
{
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) &= ~irq;
}

void cc26xx_rfcore_set_promiscuous(bool enable)
{
    if (sReceiveCmd.status == ACTIVE || sReceiveCmd.status == IEEE_SUSPENDED)
    {
        /* we have a running or backgrounded rx command */
        /* if we are promiscuous, then frame filtering should be disabled */
        rfCoreModifyRxFrameFilter(!enable);
        /* XXX should we dump any queued messages ? */
    }
    else
    {
        /* if we are promiscuous, then frame filtering should be disabled */
        sReceiveCmd.frameFiltOpt.frameFiltEn = enable ? 0 : 1;
    }
}

bool cc26xx_rfcore_get_promiscuous(void)
{
    /* we are promiscuous if we are not filtering */
    return sReceiveCmd.frameFiltOpt.frameFiltEn == 0;
}

int cc26xx_rfcore_get_txpower(void)
{

    return sCurrentOutputPower->dbm;
}

int cc26xx_rfcore_set_txpower(int dbm)
{
    int old_value = sCurrentOutputPower->dbm;
    output_config_t const *powerCfg = &(rgOutputPower[0]);

    for (unsigned i = 1; i < OUTPUT_CONFIG_COUNT; i++)
    {
        if (rgOutputPower[i].dbm >= dbm) {
            powerCfg = &(rgOutputPower[i]);
        }
        else {
            break;
        }
    }

    if (powerCfg->dbm != old_value) {
        if (cc26xx_rfcore_state != cc2650_stateDisabled) {
            rfc_CMD_SET_TX_POWER_t cmd = {
                .commandNo = CMD_SET_TX_POWER,
                .txPower = powerCfg->value
            };

            unsigned res = RFCDoorbellSendTo((uint32_t)&cmd) & 0xFF;
            if (res == CMDSTA_Done) {
                sCurrentOutputPower = powerCfg;
            }
        }
    }

    return sCurrentOutputPower->dbm;
}

void cc26xx_rfcore_set_addr_ext(uint8_t *addr)
{
    for (size_t i = 0; i < IEEE802154_LONG_ADDRESS_LEN; i++) {
        ((uint8_t *)&sReceiveCmd.localExtAddr)[i] = addr[(IEEE802154_LONG_ADDRESS_LEN - 1) - i];
    }
}

void cc26xx_rfcore_set_addr_short(uint8_t *addr)
{
    for (size_t i = 0; i < IEEE802154_SHORT_ADDRESS_LEN; i++) {
        ((uint8_t *)&sReceiveCmd.localShortAddr)[i] = addr[(IEEE802154_SHORT_ADDRESS_LEN - 1) - i];
    }
}















#if 0
/**
 * Function documented in platform/radio.h
 */
bool otPlatRadioIsEnabled(otInstance *aInstance)
{
    (void)aInstance;
    return (cc26xx_rfcore_state != cc2650_stateDisabled);
}

/**
 * Function documented in platform/radio.h
 */
unsigned otPlatRadioDisable(otInstance *aInstance)
{
    unsigned error = OT_ERROR_BUSY;
    (void)aInstance;

    if (cc26xx_rfcore_state == cc2650_stateDisabled)
    {
        error = OT_ERROR_NONE;
    }
    else if (cc26xx_rfcore_state == cc2650_stateSleep)
    {
        rfCoreSendDisableCmd();
        /* we don't want to fail if this command string doesn't work, just turn
         * off the whole core
         */
        rfCorePowerOff();
        cc26xx_rfcore_state = cc2650_stateDisabled;
        error  = OT_ERROR_NONE;
    }

    return error;
}

/**
 * Function documented in platform/radio.h
 */
unsigned otPlatRadioEnergyScan(otInstance *aInstance, uint8_t aScanChannel, uint16_t aScanDuration)
{
    unsigned error = OT_ERROR_BUSY;
    (void)aInstance;

    if (cc26xx_rfcore_state == cc2650_stateSleep)
    {
        cc26xx_rfcore_state = cc2650_stateEdScan;
        otEXPECT_ACTION(rfCoreSendEdScanCmd(aScanChannel, aScanDuration) == CMDSTA_Done, error = OT_ERROR_FAILED);
        error = OT_ERROR_NONE;
    }

exit:
    return error;
}

/**
 * Function documented in platform/radio.h
 */
unsigned otPlatRadioReceive(otInstance *aInstance, uint8_t aChannel)
{
    unsigned error = OT_ERROR_BUSY;
    (void)aInstance;

